# IndexStreamTriangle Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IndexStreamTriangle Class
Members See Also
---
A stream that can be used to write IndexTriangle primitives into an IndexBuffer
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public class IndexStreamTriangle : IndexStream
```

Visual Basic
---
```text
Public Class IndexStreamTriangle _
	Inherits IndexStream
```

Visual C++
---
```text
public ref class IndexStreamTriangle : public IndexStream
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.DirectContext3D..::..IndexStream Autodesk.Revit.DB.DirectContext3D..::..IndexStreamTriangle
# See Also
IndexStreamTriangle Members
Autodesk.Revit.DB.DirectContext3D Namespace